; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	thermograph3 - mode
	infrared2 - mode
	image0 - mode
	image1 - mode
	GroundStation1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star2)
	(supports instrument2 image0)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet5)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 image0)
	(supports instrument4 thermograph3)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 image0)
	(supports instrument5 thermograph3)
	(supports instrument5 infrared2)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
)
(:goal (and
	(pointing satellite0 Phenomenon16)
	(have_image Planet5 infrared2)
	(have_image Phenomenon6 thermograph3)
	(have_image Star7 thermograph3)
	(have_image Planet8 thermograph3)
	(have_image Phenomenon9 image1)
	(have_image Phenomenon10 image0)
	(have_image Planet11 image0)
	(have_image Planet12 thermograph3)
	(have_image Star13 image0)
	(have_image Phenomenon14 infrared2)
	(have_image Planet15 image0)
	(have_image Phenomenon16 thermograph3)
	(have_image Planet17 thermograph3)
))

)

; plan
1. (turn_to satellite1 groundstation0 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 groundstation0)
   goals met: 0 of 14
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 14
3. (calibrate satellite1 instrument4 groundstation0)
   added: (calibrated instrument4)
   goals met: 0 of 14
4. (turn_to satellite1 phenomenon9 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon9)
   goals met: 0 of 14
5. (take_image satellite1 phenomenon9 instrument4 image1)
   added: (have_image phenomenon9 image1)
   goals met: 1 of 14
6. (turn_to satellite1 phenomenon6 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon6)
   goals met: 1 of 14
7. (take_image satellite1 phenomenon6 instrument4 thermograph3)
   added: (have_image phenomenon6 thermograph3)
   goals met: 2 of 14
8. (turn_to satellite1 phenomenon16 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon16)
   goals met: 2 of 14
9. (take_image satellite1 phenomenon16 instrument4 thermograph3)
   added: (have_image phenomenon16 thermograph3)
   goals met: 3 of 14
10. (turn_to satellite1 phenomenon10 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 phenomenon10)
   goals met: 3 of 14
11. (turn_to satellite0 groundstation4 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation4)
   goals met: 3 of 14
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 14
13. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 3 of 14
14. (take_image satellite1 phenomenon10 instrument4 image0)
   added: (have_image phenomenon10 image0)
   goals met: 4 of 14
15. (turn_to satellite0 phenomenon14 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon14)
   goals met: 4 of 14
16. (take_image satellite0 phenomenon14 instrument0 infrared2)
   added: (have_image phenomenon14 infrared2)
   goals met: 5 of 14
17. (turn_to satellite0 planet11 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet11)
   goals met: 5 of 14
18. (take_image satellite0 planet11 instrument0 image0)
   added: (have_image planet11 image0)
   goals met: 6 of 14
19. (turn_to satellite0 planet15 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet15)
   goals met: 6 of 14
20. (take_image satellite0 planet15 instrument0 image0)
   added: (have_image planet15 image0)
   goals met: 7 of 14
21. (turn_to satellite0 planet5 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet5)
   goals met: 7 of 14
22. (take_image satellite0 planet5 instrument0 infrared2)
   added: (have_image planet5 infrared2)
   goals met: 8 of 14
23. (turn_to satellite0 phenomenon16 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon16)
   goals met: 9 of 14
24. (turn_to satellite1 planet12 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet12)
   goals met: 9 of 14
25. (take_image satellite1 planet12 instrument4 thermograph3)
   added: (have_image planet12 thermograph3)
   goals met: 10 of 14
26. (turn_to satellite1 planet17 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet17)
   goals met: 10 of 14
27. (take_image satellite1 planet17 instrument4 thermograph3)
   added: (have_image planet17 thermograph3)
   goals met: 11 of 14
28. (turn_to satellite1 planet8 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 planet8)
   goals met: 11 of 14
29. (take_image satellite1 planet8 instrument4 thermograph3)
   added: (have_image planet8 thermograph3)
   goals met: 12 of 14
30. (turn_to satellite1 star13 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star13)
   goals met: 12 of 14
31. (take_image satellite1 star13 instrument4 image0)
   added: (have_image star13 image0)
   goals met: 13 of 14
32. (turn_to satellite1 star7 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star7)
   goals met: 13 of 14
33. (take_image satellite1 star7 instrument4 thermograph3)
   added: (have_image star7 thermograph3)
   goals met: 14 of 14
